Revit 2026 API

# PrintSetup Methods

---

The PrintSetup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Delete | Delete the current print setting, and make the In-Session setting as the current one. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Rename | Rename the current print setting with the specified name. |
|  | Revert | Revert the current print setting. |
|  | Save | Save the changes for the current print setting. |
|  | SaveAs | Save the current print setting to another print setting with the specified name. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PrintSetup Class

Autodesk.Revit.DB Namespace